<?php
/* * *********************************************************
 * [cml] (C)2012 - 3000 cml http://cmlphp.com
 * @Author  linhecheng<linhechengbush@live.com>
 * @Date: 16-7-30 下午2:23
 * @version  2.7
 * 数据验证类语言包
 * *********************************************************** */
return [
	'require'      => "不能为空",
	'gt'           => "必须大于 %s",
	'lt'           => "必须小于 %s",
	'lengthGt'        => "长度必须大于 %d",
	'lengthLt'        => "长度必须小于 %d",
	'in'            => "无效的值",
	'notIn'         => "无效的值",
	'length'         => "字符串长度必须在 %d, %d之间",
	'empty'         => "必须为空",
	'equals'        => "必须和 '%s' 一致",
	'different'     => "必须和 '%s' 不一致",
	'arr'       => "必须是数组",
	'email'         => "无效邮箱地址",
	'ip'            => "无效IP地址",
	'number'       => "只能是数字",
	'int'       => "只能是整数",
	'bool'       => "只能是布尔值",
	'card'       => "必须是身份证",
	'mobile'       => "手机号码不正确",
	'phone'       => "固话格式不正确",
	'url'           => "无效的URL",
	'zip'         => "邮政编码不对",
	'qq'         => "qq号格式不正确",
	'english'      => "只能包括英文字母(A-za-z)",
	'chinese'          => "只能为中文"
];