<?php
/* * *********************************************************
 * [cmlphp] (C)2012 - 3000 http://cmlphp.com
 * @Author  linhecheng<linhechengbush@live.com>
 * @Date: 16-7-30 下午2:23
 * @version  @see \Cml\Cml::VERSION
 * 数据验证类语言包
 * *********************************************************** */
return [
    'require' => "的值不能为空",
    'string' => "的值必须为字符串",
    'gt' => "的值必须大于%s",
    'lt' => "的值必须小于%s",
    'gte' => "的值必须大于等于%s",
    'lte' => "的值必须小于等于%s",
    'between' => '的值必须在%d, %d之间',
    'lengthGt' => "的长度必须大于%d个字符",
    'lengthLt' => "的长度必须小于%d个字符",
    'lengthGte' => "的长度必须大于等于%d个字符",
    'lengthLte' => "的长度必须小于等于%d个字符",
    'lengthBetween' => "的长度必须为%d-%d个字符",
    'in' => "为无效的值",
    'notIn' => "为无效的值",
    'length' => "的长度为%d至%d个字",
    'empty' => "的值必须为空",
    'equals' => "的值必须和'%s'一致",
    'different' => "的值必须和'%s'不一致",
    'arr' => "的值必须是数组",
    'email' => "的值为无效邮箱地址",
    'ip' => "的值为无效IP地址",
    'number' => "的值只能是数字",
    'int' => "的值只能是整数",
    'bool' => "的值只能是布尔值",
    'card' => "的值必须是身份证",
    'mobile' => "的值必须为手机号",
    'phone' => "的值必须为固话格式",
    'url' => "的值为无效的URL",
    'zip' => "的值必须为邮政编码",
    'qq' => "的值必须为qq号格式",
    'english' => "的值只能包括英文字母(A-Za-z)",
    'chinese' => "的值只能为中文"
];